Repository: lang-uk/translation-metrics
Catalog: data/17099743/Animal_farm_combine.tmx
Source language: en_1945_george_orwell_animal_farm
Languages: uk_1984_iryna_dybko_khutir_tvaryn, uk_1991_yurii_shevchuk_ferma_rai_dlia_tv, uk_2020_bohdana_nosenok_kolhosp_tvaryn

source: They took refuge in the farm buildings and peeped cautiously out from chinks and knot-holes.
uk_1984_iryna_dybko_khutir_tvaryn: [Зі своїх сховищ спостерігали тварини]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Порозбігавшись по хлівах, вони боязко визирали в щілини та дірки в стінах.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Вони сховалися в хлівах і сараях, обережно визираючи крізь щілини.

source: The whole of the big pasture, including the windmill, was in the hands of the enemy.
uk_1984_iryna_dybko_khutir_tvaryn: Таким чином, нашвидку пасовисько й вітряк був у руках Федорикова.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Все велике пасовисько, разом з вітряком, втрапило до рук ворога.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Все велике пасовисько було в руках ворогів і пагорб теж.

source: If Pilkington and his men would help them, the day might yet be won.
uk_1984_iryna_dybko_khutir_tvaryn: Якби Пілсутов не відмовив помочі, може могли б вони ще врятувати вітряк. На жаль, так воно не було.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: якби Пілкінгтон та його люди підсобили, битву ще можна було б виграти.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Якщо Пілкінгтон і його люди прийдуть на допомогу, ще можна перемогти.

source: Two of the men had produced a crowbar and a sledge hammer. They were going to knock the windmill down.
uk_1984_iryna_dybko_khutir_tvaryn: [Зі своїх сховищ спостерігали тварини, як два чоловіка велетенськими молотами старалися розвалити стіни вітряка.]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Двоє узяло лом і молот — вони збиралися розвалювати вітряк.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Двоє людей узяли до рук лом і кирку. Мабуть, збиралися ламати млин.

source: “Impossible!” cried Napoleon. “We have built the walls far too thick for that. They could not knock it down in a week.
uk_1984_iryna_dybko_khutir_tvaryn: Удари молотів об стіни вітряка дужчали, але Вісарйонов потішав свою залогу, що люди не зуміють розвалити їх, бо вони на цей раз тричі грубші.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Не вийде! — загорлав Наполеон. — Ми звели надто товсті стіни, тож це не так легко зробити. Вони й за тиждень не розвалять його!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Не вийде! — скрикнув Наполеон. — Ми звели надто товсті стіни. Їм не зламати їх і за тиждень.

source: Courage, comrades!”
uk_1984_iryna_dybko_khutir_tvaryn: «Будьте хоробрі, товариші!» — гукав Вісарйонов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Не падайте духом, товариші!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Спокійно, товариші!

source: But Benjamin was watching the movements of the men intently. The two with the hammer and the crowbar were drilling a hole near the base of the windmill.
uk_1984_iryna_dybko_khutir_tvaryn: Тільки Молчазніков не довіряв бадьорим словам вождя, бо приглядаючись уважно до того, що люди робили, бачив, як вони провертіли діру в підвалі вітряка й проклали туди довге дуло.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Бенджамін не зводив погляду з тих двох, що довбали в підмурівку якусь дірку.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Бенджамін, який уважно спостерігав за діями людей, одразу зрозумів, що вони задумали, коли ті двоє почали видовбувати дірку у фундаменті млина.

source: Slowly, and with an air almost of amusement, Benjamin nodded his long muzzle.
uk_1984_iryna_dybko_khutir_tvaryn: Молчазніков зразу догадався в чому справа й попередив залогу:
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Повільно, майже з тихою радістю на обличчі Бенджамін закивав своєю довгастою мордою.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: І повільно, майже із задоволенням, похитав головою.

source: In another moment they are going to pack blasting powder into that hole.”
uk_1984_iryna_dybko_khutir_tvaryn: Дивіться, товариші, зараз люди покладуть туди вибухову речовину.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: За хвилю вони засиплють у ту дірку порох.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: У дірку закладуть вибухівку.

source: Then there was a deafening roar. The pigeons swirled into the air, and all the animals, except Napoleon, flung themselves flat on their bellies and hid their faces.
uk_1984_iryna_dybko_khutir_tvaryn: — Ще не притихли слова Молчазнікова, як пронісся гучний вибух; усі тварини припали ниць до землі, а голуби злетіли у висоти.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А тоді розлігся оглушливий гуркіт. Голуби знялися в повітря, а тварини, крім Наполеона, попадали, поприпадали до землі, ховаючи голови.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: а потім гримнуло так, що голуби злетіли в повітря, а інші тварини, крім Наполеона, попадали на землю і притислися до неї.

source: When they got up again, a huge cloud of black smoke was hanging where the windmill had been. Slowly the breeze drifted it away. The windmill had ceased to exist!
uk_1984_iryna_dybko_khutir_tvaryn: Коли затих вибух, із цього місця, де ще так недавно стояв вітряк, підносились хмари чорного диму, а коли щезли під сильним подувом вітру, тоді з ними щез і вітряк...
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А коли підвели їх, то величезна чорна хмара диму здіймалася там, де стояв вітряк. її поволі відносило вітром. Вітряка ж як не було!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А коли підвели голови, то побачили величезну хмару чорного диму над місцем, де раніше стояв вітряк. Вітерець повільно відносив її. Млина більше не було!

source: The fear and despair they had felt a moment earlier were drowned in their rage against this vile, contemptible act. A mighty cry for vengeance went up, and without waiting for further orders they charged forth in a body and made straight for the enemy.
uk_1984_iryna_dybko_khutir_tvaryn: Розпач по втраті вітряка перемогла страх і всі, як один, вийшли зі своїх криївок, кинувшись у нестямі на ворога.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Страх і розпач, що охопили їх ще хвилину тому, затопила лють на цей підлий і негідний вчинок. Залунав могутній поклик до помсти, і без подальших наказів вони ринулися на ворога.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Страх і відчай, які щойно охопили їх, потонули у хвилі люті, викликаної цим огидним злочином. Пролунав лютий заклик до помсти, і, не чекаючи наказу, тварини кинулися на ворога.

source: It was a savage, bitter battle.
uk_1984_iryna_dybko_khutir_tvaryn: Ох, і була це жорстока боротьба!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: То була запекла, страшна січа.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: То був запеклий бій.

source: The men fired again and again, and, when the animals got to close quarters, lashed out with their sticks and their heavy boots.
uk_1984_iryna_dybko_khutir_tvaryn: Люди безпощадно стріляли до тварин, багато з них поранивши,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Раз у раз ляскали рушничні постріли, а коли тварини таки пробилися впритул, їх стали мотлошити кийками і важкими черевиками.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Люди стріляли знову й знову. А коли тварини наблизилися впритул, били їх палицями й кованими чобітьми.

source: A cow, three sheep, and two geese were killed, and nearly everyone was wounded.
uk_1984_iryna_dybko_khutir_tvaryn: а корова, три овечки та ще й три гуски загинули в запеклій битві. Та це не спиняло завзяття поранених, вони напроти пострілів наступали з дрючками.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Полягли корова, три вівці й дві гуски, а майже всі інші дістали поранення.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Корова, три вівці та два гусаки впали без духу, майже всі інші були поранені.

source: Even Napoleon, who was directing operations from the rear, had the tip of his tail chipped by a pellet.
uk_1984_iryna_dybko_khutir_tvaryn: [Навіть Вісарйонов, що був позаду, мав зранений хвіст.]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Навіть Наполеону, який керував атакою з тилу, кулею одірвало кінчик хвостика.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Навіть у Наполеона, що керував боєм у тилу, дробинкою відбило кінчик хвоста.

source: Three of them had their heads broken by blows from Boxer’s hoofs; another was gored in the belly by a cow’s horn; another had his trousers nearly torn off by Jessie and Bluebell.
uk_1984_iryna_dybko_khutir_tvaryn: Добрилов частував людей своїми могутніми ударами копит, Конева йому помагала, корова рогами колола, а пси кусали людей в ноги.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Трьом Боксер копитом розтрощив голову; іншому корова простромила рогами живіт; у того Джессі та Квітка мало не стягли штанів.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Трьом чоловікам Боксер проломив голови, одного корова підняла на роги, ще в одного Бессі й Блюбелл мадо не стягли штани.

source: And when the nine dogs of Napoleon’s own bodyguard, whom he had instructed to make a detour under cover of the hedge, suddenly appeared on the men’s flank, baying ferociously, panic overtook them.
uk_1984_iryna_dybko_khutir_tvaryn: Один із псів Вісарйонова кинувся на помічників Федорикова, й ті в переполосі з болем від покусань почали втікати.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: [ коли на людей з лютим гавкотом вискочила дев'ятка псів із особистої охорони Наполеона, які дістали наказ зайти їм у фланг під прикриттям живоплоту, людей опосів панічний жах.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А коли пси Наполеона, яким він наказав обійти ворога з тилу, раптово вискочили у фланг супротивникові з лютим гавкотом, людей охопила паніка —

source: Frederick shouted to his men to get out while the going was good, and the next moment the cowardly enemy was running for dear life.
uk_1984_iryna_dybko_khutir_tvaryn: Побачивши, що люди втікають, Федориков дав наказ відступати.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Фредерік гукнув людям тікати, і малодушний ворог дав ногам знати, рятуючи свою дорогоцінну шкуру.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Фредерік наказав відступати, і озброєний ворог кинувся навтьоки, рятуючи життя.

source: The animals chased them right down to the bottom of the field, and got in some last kicks at them as they forced their way through the thorn hedge.
uk_1984_iryna_dybko_khutir_tvaryn: За втікачами вслід погнались розлючені тварини.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тварини гналися за ними аж до поля, а коли ті продиралися крізь колючий живопліт, вгамселили їм останнього копняка.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тварини гнали людей до живоплоту, а коли ті почали продиратися крізь нього, допомагали їм копняками.

source: They had won, but they were weary and bleeding.
uk_1984_iryna_dybko_khutir_tvaryn: І цим разом тварини перемогли. Правда, не було ні одного із тих, що залишились в живих, аби не спливав кров’ю від поранень з пострілів.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вони перемогли, але й самі були знесилені та зранені.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Перемога дісталася колгоспникам дорогою ціною.

source: The sight of their dead comrades stretched upon the grass moved some of them to tears.
uk_1984_iryna_dybko_khutir_tvaryn: Проходячи біля мертвих друзів, звірята сумовито притихли й не одне з них просльозилось.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Декого до сліз зворушили мертві товариші, розпластані на землі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Сльози навернулися деяким на очі, коли по дорозі траплялися мертві товариші.

source: And for a little while they halted in sorrowful silence at the place where the windmill had once stood.
uk_1984_iryna_dybko_khutir_tvaryn: Відтак пошкандибали на горбок поглянути на руїни вітряка; в мовчанні похилили голови, бо й не вірилось їм, що ось на цьому місці поклали стільки мозольних трудів, стільки даремної праці, зчаста в голоді...
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А там, де колись стояв вітряк, постояли в скорботному мовчанні.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: У скорботному мовчанні постояли вони біля місця, де височів раніше млин.

source: Yes, it was gone; almost the last trace of their labour was gone!
uk_1984_iryna_dybko_khutir_tvaryn: А то у кількох хвилинах повернулось усе внівець,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Так, його не стало! Майже останнього витвору їхніх рук не стало!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Його не стало, не залишилося жодних ознак їхньої нелегкої праці.

source: Even the foundations were partially destroyed.
uk_1984_iryna_dybko_khutir_tvaryn: бо навіть і підвалини знищено дощенту.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Навіть підмурівок частково постраждав.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Навіть фундамент був частково зруйнований.

source: The force of the explosion had flung them to distances of hundreds of yards.
uk_1984_iryna_dybko_khutir_tvaryn: [тільки каменюки порозкидувані в безладді.]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вибухом його порозкидало на сотні метрів.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: силою вибуху його порозкидало на сотні метрів навсібіч.

source: It was as though the windmill had never been.
uk_1984_iryna_dybko_khutir_tvaryn: Тепер виглядає все так, як би тут і вітряка ніколи не було, тільки каменюки порозкидувані в безладді.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наче й не було того вітряка ніколи.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Млина наче й не було ніколи.

source: As they approached the farm Squealer, who had unaccountably been absent during the fighting, came skipping towards them, whisking his tail and beaming with satisfaction.
uk_1984_iryna_dybko_khutir_tvaryn: Коли, покинувши місце вітряка, доходили тварини до майдана, назустріч їм вийшов Нікітов. Його, до речі, ніхто й не бачив під час битви. Променюючи від вдоволення, привітав він тварин, заки мали вони змогу розпитати в чому справа.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вони наблизилися до ферми, а назустріч їм, помахуючи хвостиком і вкрай задоволений вискочив Пищик, якого чомусь ніде не було видно під час бою.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Коли вони наблизилися до господарських будівель, Пискун, якого ніде не було видно, поки йшла битва, вискочив їм назустріч, підстрибуючи й задоволено метляючи хвостиком.

source: And the animals heard, from the direction of the farm buildings, the solemn booming of a gun.
uk_1984_iryna_dybko_khutir_tvaryn: Раптом пронісся вистріл з рушниці біля прапора.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Від ферми раптом пролунав рушничний постріл.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: З боку будівель раптом пролунав постріл.

source: “What is that gun firing for?” said Boxer.
uk_1984_iryna_dybko_khutir_tvaryn: — З якої причини стріляють з рушниці? — запитав здивовано Добрилов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Хто це там стріляє? — збентежився Боксер.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Хто стріляє? — занепокоївся Боксер.

source: “To celebrate our victory!” cried Squealer.
uk_1984_iryna_dybko_khutir_tvaryn: — Для прославлення нашої перемоги! — з неприхованим задоволенням відповів Нікітов, при тому й підстрибуючи час від часу.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Таж то на честь нашої перемоги! — вигукнув Пищик.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Це на честь нашої перемоги! — вигукнув Пискун.

source: “What victory?” said Boxer. His knees were bleeding, he had lost a shoe and split his hoof, and a dozen pellets had lodged themselves in his hind leg.
uk_1984_iryna_dybko_khutir_tvaryn: — Якої перемоги? — пригноблено запитав Добрилов, похилив голову та глянув на зранену задню ногу й на коліна, з яких постійно спливала кров.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Якої ще перемоги? — 3 колін Боксера текла кров, він втратив підкову й розколов копито, а в крупі застрягло з десяток шротинок.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Якої перемоги? — запитав Боксер. У нього з колін текла кров, він загубив підкову й розбив копито, а в тілі сиділа дюжина дробинок.

source: “What victory, comrade?
uk_1984_iryna_dybko_khutir_tvaryn: Ти питаєш, яка перемога? — подразнено, пискливим голосом відозвався Нікітов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Як якої, товаришу?
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Яку перемогу, товариші?

source: Have we not driven the enemy off our soil — the sacred soil of Animal Farm?”
uk_1984_iryna_dybko_khutir_tvaryn: — Чи не прогнали ми ворога з нашої землі?
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Адже ми прогнали ворога з нашої землі, священної землі «Раю для Тварин»!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Хіба ми не вигнали ворога з нашої землі — священної землі «Колгоспу тварин»?

source: “But they have destroyed the windmill.
uk_1984_iryna_dybko_khutir_tvaryn: Але ж вони знищили нам вітряк.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Але ж вони зруйнували наш вітряк.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Але вони зруйнували наш млин!

source: And we had worked on it for two years!”
uk_1984_iryna_dybko_khutir_tvaryn: Ми ж його два роки з таким великим зусиллям будували, — продовжував Добрилов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А ми його зводили аж два роки!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А ми працювали два роки, щоб побудувати його!

source: “What matter?
uk_1984_iryna_dybko_khutir_tvaryn: — Товариші, гей, товариші. Ну, і що такого?!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Велике діло!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — То й що?

source: We will build six windmills if we feel like it.
uk_1984_iryna_dybko_khutir_tvaryn: Ми ще спроможні шість таких вітряків збудувати.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Навіть шість їх збудуємо, як захочемо.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Збудуємо шість млинів за потреби.

source: The enemy was in occupation of this very ground that we stand upon.
uk_1984_iryna_dybko_khutir_tvaryn: Чи не важніше те, що ми прогнали тяжкого ворога з нашої землі?
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Ворог окупував ось цю землю, на якій ми стоїмо.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Та сама земля, на якій ми зараз стоїмо, перебувала в руках ворога.

source: And now — thanks to the leadership of Comrade Napoleon — we have won every inch of it back again!”
uk_1984_iryna_dybko_khutir_tvaryn: Тут напали на нас погані люди, хотіли забрати нам нашу землю, але завдяки провідництву нашого доброго вождя, товариша Вісарйонова, оборонились ми, захищаючи відважно кожну п’ядь нашого хутора.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А тепер, дякуючи товаришу Наполеону, ми знову відвоювали її до останньої п'яді.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А тепер, завдяки військовому генію товариша Наполеона, ми відвоювали її до останнього метра!

source: “Then we have won back what we had before,” said Boxer.
uk_1984_iryna_dybko_khutir_tvaryn: Але ж ми нічого не здобули, а втратили друзів і вітряк, відповів потурбовано Добрилов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Значить, ми відвоювали те, що доти мали, — вирішив Боксер.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Тож ми відвоювали те, що в нас і раніше було, — сказав Боксер.

source: “That is our victory,” said Squealer.
uk_1984_iryna_dybko_khutir_tvaryn: От, друзі товариші, ви не розумієте, про що йде, наша перемога, не важливо яким коштом здобута, в тому, що ми прогнали звідси людей, — заявив гордо, єхидно всміхаючись Нікітов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Оце і є наша перемога, — підсумував Пищик.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — У цьому — наша перемога, — наголосив Пискун.

source: They limped into the yard.
uk_1984_iryna_dybko_khutir_tvaryn: Кульгаючи, відходили тварини до своїх приміщень, тільки щораз мусіли зупинятися, бо біль був нестерпний.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вони пошкандибали в двір.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Нарешті тварини дошкандибали до двору.

source: The pellets under the skin of Boxer’s leg smarted painfully.
uk_1984_iryna_dybko_khutir_tvaryn: Зранена нога й коліно Добрилова дошкульно боліли.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Шротинки під шкірою Боксера болісно пекли.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Біль від дробинок, що засіли в тілі Боксера, дедалі посилювався.

source: He saw ahead of him the heavy labour of rebuilding the windmill from the foundations, and already in imagination he braced himself for the task.
uk_1984_iryna_dybko_khutir_tvaryn: А коли прийшло на гадку, що треба буде запрягти себе до тяжкої праці для відбудови вітряка,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А попереду він бачив тяжку відбудову вітряка, починаючи з підмурків, і подумки вже готувався до цього.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А попереду йому бачилася важка праця з відновлення повністю зруйнованого вітряка й подумки він збирався з силами.

source: But for the first time it occurred to him that he was eleven years old and that perhaps his great muscles were not quite what they had once been.
uk_1984_iryna_dybko_khutir_tvaryn: почав і свій вік відчувати — отих одинадцять років життя; відчував бо, що м’язи не ті, що колись були, та що сила слабшає.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Але чи не вперше подумав, що йому одинадцять років і що його потужні м'язи вже напевне не ті, що колись.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Проте чи не вперше подумав, що одинадцять років — це вже не молодість, і напевно його потужні м’язи — вже не ті, що колись.

source: But when the animals saw the green flag flying, and heard the gun firing again — seven times it was fired in all — and heard the speech that Napoleon made, congratulating them on their conduct, it did seem to them after all that they had won a great victory.
uk_1984_iryna_dybko_khutir_tvaryn: Враз поглянули тварини на головний будинок, бо звернуло їхню увагу лопотіння прапора; тут же й почули сім пострілів з рушниці, а тоді наступила промова Вісарйонова. Він прославляв усіх за хоробрість у битві. Таким чином мимохіть були під враженням великої перемоги.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Та коли тварини побачили, як затріпотів зелений прапор, коли почули знову рушничні постріли — сім разів підряд і послухали Наполеонову промову, в якій той відзначив їхню хоробрість, то все було так, наче вони здобули неабияку перемогу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Та ось замайорів зелений прапор, знову загупала рушниця поспіль сім разів, виголосив промову Наполеон, в якій згадав про героїчну звитягу захисників Колгоспу, — і тваринам здалося, що вони й справді здобули велику перемогу.

source: The animals slain in the battle were given a solemn funeral.
uk_1984_iryna_dybko_khutir_tvaryn: Поховали всі жертви, що згинули в битві, поховали з великими почестями;
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тварин, полеглих у бою, врочисто поховали.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Полеглих у битві урочисто поховали.

source: Boxer and Clover pulled the wagon which served as a hearse, and Napoleon himself walked at the head of the procession.
uk_1984_iryna_dybko_khutir_tvaryn: Коневу й Добрилова запрягли до воза, на якому лежали вбиті друзі. З-перед похорону йшов Вісарйонов.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Боксер і Конюшинка тягли візок, що правив за катафалк, а сам Наполеон очолював процесію.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Боксер і Люцерна тягнули віз, що слугував лафетом. Процесію очолював сам Наполеон.

source: Two whole days were given over to celebrations.
uk_1984_iryna_dybko_khutir_tvaryn: Чергові два дні призначено на урочистості:
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Святкували аж два дні.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Святкували два дні.
